{
    "summary": {
        "nav-about": "À PROPOS",
        "nav-experience": "EXPÉRIENCE",
        "nav-technologies": "TECHNOLOGIES & FONDAMENTAUX",
        "nav-education": "FORMATION",
        "hero-title": "Ingénieur en Systèmes Informatiques | Développeur Full Stack | DevOps",
        "hero-statement": "Je conçois, construis et déploie des **solutions logicielles robustes** et des **services cloud évolutifs**, en appliquant les principes DevOps pour garantir l'efficacité et la qualité.",
        "about-title-mobile": "À Propos",
        "about-p1": "Ingénieur en Systèmes Informatiques spécialisé en **Développement Logiciel et DevOps**. Passionné par la création d'infrastructures cloud efficaces et de logiciels de haute qualité, avec une expérience pratique de **Google Cloud (GCP), BigQuery et des fondamentaux du ML/IA** acquise via le programme Google.",
        "about-p2": "J'applique mes compétences sur l'ensemble du cycle de vie du développement logiciel — du **codage et des tests jusqu'au déploiement et à l'automatisation** — pour créer des solutions technologiques qui apportent une réelle valeur ajoutée et résolvent des défis complexes.",
        "about-p3": "Mon expérience précédente dans la gestion de données critiques m'a fourni une base solide en **précision, optimisation des processus et assurance qualité** — des principes que j'applique rigoureusement à chaque ligne de code et à chaque déploiement.",
        "experience-title": "EXPÉRIENCE PROFESSIONNELLE",
        "exp1-title": "Analyste de Données et de Processus",
        "exp1-company": "Laboratoires Curie",
        "exp1-li1": "**Gestion de Données & SQL :** J'ai conçu et géré des bases de données de patients, garantissant une intégrité et une disponibilité maximales des données pour des analyses critiques.",
        "exp1-li2": "**Analyse de Corrélation :** J'ai développé et réalisé des analyses complexes pour identifier des corrélations médicales et optimiser le suivi des patients.",
        "exp1-li3": "**Optimisation des Processus :** J'ai appliqué des principes d'ingénierie des systèmes pour améliorer la traçabilité de l'information clinique, entraînant une réduction significative des erreurs manuelles.",
        "exp2-title": "Assistant de Laboratoire Clinique",
        "exp2-company": "CERADI, SA CV",
        "exp2-li1": "Soutien dans les zones d'analyse et les services de phlébotomie.",
        "exp3-title": "Tuteur d'Anglais",
        "exp3-company": "École Allende College",
        "exp3-li1": "J'ai travaillé comme professeur complémentaire, en gérant des groupes d'enfants.",
        "tech-title": "TECHNOLOGIES & FONDAMENTAUX",
        "tech-cloud-title": "Infrastructure Cloud & Fondamentaux des Données",
        "tech-virt": "Virtualisation",
        "tech-os": "Systèmes d'Exploitation",
        "tech-dev-title": "Langages & Stack de Développement Principal",
        "cert-title": "Certifications & Formations (Programme Google Cloud)",
        "cert-li1": "**Construire et Sécuriser des Réseaux**",
        "cert-li2": "**Créer et Gérer des Ressources Cloud**",
        "cert-li3": "**Réaliser des Tâches Fondamentales de Données, ML et IA**",
        "cert-li4": "Mettre en œuvre une Infrastructure Fondamentale.",
        "edu-title": "FORMATION",
        "edu1-title": "Licence en Ingénierie des Systèmes Informatiques",
        "edu1-school": "TecNM Atitalaquia",
        "edu1-desc": "Axé sur les fondamentaux du logiciel, du matériel et de l'architecture des systèmes.",
        "edu2-title": "Programme de Formation en Cloud Computing",
        "edu2-school": "Bourse d'études par INROADS et Google",
        "edu2-desc": "Programme intensif axé sur l'implémentation et la gestion de solutions cloud, y compris les fondamentaux d'AWS et de GCP.",
        "footer-text": "Conçu et Codé par Brian Ivan Ruiz Angeles.",
        "html-lang": "fr",
        "mode-toggle-text": "Mode Complet",
        "full-exp-title": "Détails Complets de l'Expérience",
        "full-exp-placeholder": "Cette section est actuellement en **Mode Résumé**. Passez en **Mode Complet** pour voir les détails approfondis des projets, les métriques et les descriptions étendues pour chaque rôle."
    },
    "full": {
        "about-p1": "En tant qu'Ingénieur Systèmes, je me spécialise dans la conception, la mise en œuvre et la maintenance de **solutions robustes de Cloud Computing**. Mon intérêt se porte sur les **infrastructures évolutives et distribuées**, une passion consolidée par une bourse de formation intensive via le programme Google. Je possède une connaissance pratique de **Google Cloud (GCP), BigQuery et des tâches fondamentales en ML/IA**, ce qui me prépare à relever les défis informatiques de nouvelle génération.",
        "exp1-li1": "**Gestion de Données & SQL :** J'ai géré et optimisé des bases de données de patients à haut volume (plus de 10 000 enregistrements), garantissant une **intégrité des données de 99,9 %** et une disponibilité instantanée pour l'analyse médicale en utilisant SQL avancé pour les requêtes et les rapports.",
        "exp1-li3": "**Optimisation des Processus :** J'ai automatisé la traçabilité de l'information clinique en implémentant une nouvelle logique système, ce qui a **réduit les erreurs de saisie manuelle de 30 %** et accéléré les processus de suivi des patients.",
        "full-exp-title": "Expérience Détaillée & Métriques d'Impact",
        "full-exp-placeholder": "Bienvenue en **Mode Complet**. Cette section détaille les réalisations quantifiables et l'impact direct de mon travail, comme : \"Développement d'un script Python pour la normalisation des données qui a réduit le temps de traitement de 40 %.\"",
        "mode-toggle-text": "Mode Résumé"
    }
}