{
    "summary": {
        "nav-about": "SOBRE MIM",
        "nav-experience": "EXPERIÊNCIA",
        "nav-technologies": "TECNOLOGIAS & FUNDAMENTOS",
        "nav-education": "EDUCAÇÃO",
        "hero-title": "Engenheiro de Sistemas de Computação | Desenvolvedor Full Stack | DevOps",
        "hero-statement": "Eu projeto, construo e implemento **soluções de software robustas** e **serviços de nuvem escaláveis**, aplicando princípios DevOps para garantir eficiência e qualidade.",
        "about-title-mobile": "Sobre Mim",
        "about-p1": "Engenheiro de Sistemas de Computação especializado em **Desenvolvimento de Software e DevOps**. Apaixonado pela criação de infraestruturas de nuvem eficientes e software de alta qualidade, com experiência prática em **Google Cloud (GCP), BigQuery e fundamentos de ML/IA** adquirida através do programa Google.",
        "about-p2": "Eu aplico minhas habilidades em todo o ciclo de vida do desenvolvimento de software — desde a **codificação e testes até a implantação e automação** — para construir soluções tecnológicas que entregam valor real e resolvem desafios complexos.",
        "about-p3": "Minha experiência anterior em gestão de dados críticos me proporcionou uma base sólida em **precisão, otimização de processos e garantia de qualidade** — princípios que aplico rigorosamente a cada linha de código e implantação.",
        "experience-title": "EXPERIÊNCIA PROFISSIONAL",
        "exp1-title": "Analista de Dados e Processos",
        "exp1-company": "Laboratórios Curie",
        "exp1-li1": "**Gestão de Dados e SQL:** Projetei e gerenciei bancos de dados de pacientes, garantindo a máxima integridade e disponibilidade dos dados para análises críticas.",
        "exp1-li2": "**Análise de Correlação:** Desenvolvi e executei análises complexas para identificar correlações médicas e otimizar o acompanhamento de pacientes.",
        "exp1-li3": "**Otimização de Processos:** Apliquei princípios de engenharia de sistemas para melhorar a rastreabilidade das informações clínicas, resultando em uma redução significativa de erros manuais.",
        "exp2-title": "Assistente de Laboratório Clínico",
        "exp2-company": "CERADI, SA CV",
        "exp2-li1": "Suporte em áreas de análise e serviços de flebotomia.",
        "exp3-title": "Tutor de Inglês",
        "exp3-company": "Escola Allende College",
        "exp3-li1": "Trabalhei como professor complementar, gerenciando grupos de crianças.",
        "tech-title": "TECNOLOGIAS & FUNDAMENTOS",
        "tech-cloud-title": "Infraestrutura de Nuvem e Fundamentos de Dados",
        "tech-virt": "Virtualização",
        "tech-os": "Sistemas Operacionais",
        "tech-dev-title": "Linguagens e Stack de Desenvolvimento Central",
        "cert-title": "Certificações e Treinamento (Programa Google Cloud)",
        "cert-li1": "**Construir e Proteger Redes**",
        "cert-li2": "**Criar e Gerenciar Recursos de Nuvem**",
        "cert-li3": "**Executar Tarefas Fundamentais de Dados, ML e IA**",
        "cert-li4": "Executar Infraestrutura Fundamental.",
        "edu-title": "EDUCAÇÃO",
        "edu1-title": "Bacharelado em Engenharia de Sistemas de Computação",
        "edu1-school": "TecNM Atitalaquia",
        "edu1-desc": "Foco em fundamentos de software, hardware e arquitetura de sistemas.",
        "edu2-title": "Programa de Treinamento em Cloud Computing",
        "edu2-school": "Bolsa de Estudo da INROADS e Google",
        "edu2-desc": "Programa intensivo focado na implementação e gestão de soluções em nuvem, incluindo fundamentos de AWS e GCP.",
        "footer-text": "Projetado e Codificado por Brian Ivan Ruiz Angeles.",
        "html-lang": "pt",
        "mode-toggle-text": "Modo Completo",
        "full-exp-title": "Detalhes Completos da Experiência",
        "full-exp-placeholder": "Esta seção está atualmente no **Modo Resumo**. Mude para o **Modo Completo** para ver detalhes aprofundados do projeto, métricas e narrativas estendidas para cada função."
    },
    "full": {
        "about-p1": "Como Engenheiro de Sistemas, eu me especializo no projeto, implementação e manutenção de **soluções robustas de Cloud Computing**. Meu foco está em **infraestruturas escaláveis e distribuídas**, uma paixão solidificada por uma bolsa de treinamento intensivo através do programa Google. Possuo conhecimento prático de **Google Cloud (GCP), BigQuery e tarefas fundamentais de ML/IA**, preparando-me para enfrentar os desafios da computação de próxima geração.",
        "exp1-li1": "**Gestão de Dados e SQL:** Gerenciei e otimizei bancos de dados de pacientes de alto volume (mais de 10.000 registros), garantindo **99.9% de integridade dos dados** e disponibilidade instantânea para análise médica usando SQL avançado para consultas e relatórios.",
        "exp1-li3": "**Otimização de Processos:** Automatizei a rastreabilidade das informações clínicas implementando uma nova lógica de sistemas, o que **reduziu os erros de entrada manual de dados em 30%** e acelerou os processos de acompanhamento de pacientes.",
        "full-exp-title": "Experiência Estendida e Métricas de Impacto",
        "full-exp-placeholder": "Bem-vindo ao **Modo Completo**. Esta seção detalha conquistas quantificáveis e o impacto direto do meu trabalho, como: \"Desenvolvi um script Python para normalização de dados que reduziu o tempo de processamento em 40%.\"",
        "mode-toggle-text": "Modo Resumo"
    }
}