{
    "summary": {
        "nav-about": "ACERCA DE",
        "nav-experience": "EXPERIENCIA",
        "nav-technologies": "TECNOLOGÍAS & FUNDAMENTOS",
        "nav-education": "EDUCACIÓN",
        "hero-title": "Ingeniero en Sistemas Computacionales | Full Stack Developer | DevOps",
        "hero-statement": "Diseño, construyo y despliego **soluciones de software robustas** y **servicios cloud escalables**, aplicando principios de DevOps para garantizar la eficiencia y la calidad.",
        "about-title-mobile": "Acerca de",
        "about-p1": "Ingeniero en Sistemas Computacionales con especialización en **Desarrollo de Software y DevOps**. Apasionado por la creación de infraestructuras cloud eficientes y el desarrollo de software de alta calidad, con experiencia práctica en **Google Cloud (GCP), BigQuery y fundamentos de ML/IA** obtenida a través del programa de Google.",
        "about-p2": "Busco aplicar mis habilidades en el ciclo de vida completo del desarrollo de software—desde la **codificación y las pruebas hasta el despliegue y la automatización**—para construir soluciones tecnológicas que aporten valor real y resuelvan desafíos complejos.",
        "about-p3": "Mi experiencia previa en la gestión de datos críticos me ha proporcionado una sólida base en **precisión, optimización de procesos y aseguramiento de la calidad**, principios que aplico rigurosamente en cada línea de código y despliegue.",
        "experience-title": "EXPERIENCIA PROFESIONAL",
        "exp1-title": "Analista de Datos y Procesos",
        "exp1-company": "Curie Laboratories",
        "exp1-li1": "**Gestión de Datos y SQL:** Diseñé y gestioné bases de datos de pacientes, garantizando la máxima integridad y disponibilidad de la información para análisis críticos.",
        "exp1-li2": "**Análisis de Correlación:** Desarrollé y ejecuté análisis complejos para identificar correlaciones médicas y optimizar el seguimiento de pacientes.",
        "exp1-li3": "**Optimización de Procesos:** Apliqué principios de ingeniería de sistemas para mejorar la trazabilidad de la información clínica, resultando en una reducción significativa de errores manuales.",
        "exp2-title": "Asistente de Laboratorio Clínico",
        "exp2-company": "CERADI, SA CV",
        "exp2-li1": "Soporte en áreas de análisis y toma de muestras (flebotomista).",
        "exp3-title": "Tutor de Inglés",
        "exp3-company": "Allende College School",
        "exp3-li1": "Trabajé como profesor complementario, a cargo de grupos de niños.",
        "tech-title": "TECNOLOGÍAS & FUNDAMENTOS",
        "tech-cloud-title": "Infraestructura Cloud y Fundamentos de Datos",
        "tech-virt": "Virtualizaciones",
        "tech-os": "Sistemas Operativos",
        "tech-dev-title": "Lenguajes y Stack de Desarrollo Central",
        "cert-title": "Certificaciones y Entrenamiento (Programa Google Cloud)",
        "cert-li1": "**Construcción y Seguridad de Redes**",
        "cert-li2": "**Creación y Gestión de Recursos Cloud**",
        "cert-li3": "**Tareas Fundacionales de Datos, ML y IA**",
        "cert-li4": "Infraestructura Fundacional.",
        "edu-title": "EDUCACIÓN",
        "edu1-title": "Ingeniería en Sistemas Computacionales",
        "edu1-school": "TecNM Atitalaquia",
        "edu1-desc": "Enfoque en fundamentos de software, hardware y arquitectura de sistemas.",
        "edu2-title": "Programa de Entrenamiento en Cloud Computing",
        "edu2-school": "Beca de INROADS y Google",
        "edu2-desc": "Programa intensivo centrado en la implementación y gestión de soluciones en la nube, incluyendo fundamentos de AWS y GCP.",
        "footer-text": "Diseñado y Codificado por Brian Ivan Ruiz Angeles.",
        "html-lang": "es",
        "mode-toggle-text": "Modo Completo",
        "full-exp-title": "Detalles Completos de la Experiencia",
        "full-exp-placeholder": "Esta sección está actualmente en **Modo Resumen**. Cambia a **Modo Completo** para ver detalles de proyectos, métricas y narrativas extendidas para cada rol."
    },
    "full": {
        "about-p1": "Como Ingeniero en Sistemas, me especializo en el diseño, implementación y mantenimiento de soluciones robustas de **Cloud Computing**. Mi enfoque se centra en **infraestructuras escalables y distribuidas**, una pasión consolidada por una beca de entrenamiento intensivo a través del programa de Google. Poseo conocimientos prácticos de **Google Cloud (GCP), BigQuery y tareas fundacionales de ML/IA**, preparándome para abordar desafíos de computación de próxima generación.",
        "exp1-li1": "**Gestión de Datos y SQL:** Gestioné y optimicé bases de datos de pacientes de alto volumen (+10,000 registros), garantizando una **integridad de datos del 99.9%** y disponibilidad instantánea para el análisis médico, utilizando SQL avanzado para consultas y reportes.",
        "exp1-li3": "**Optimización de Procesos:** Automaticé la trazabilidad de la información clínica mediante la implementación de nueva lógica de sistemas, lo que **redujo los errores de ingreso manual de datos en un 30%** y aceleró los procesos de seguimiento de pacientes.",
        "full-exp-title": "Experiencia Extendida y Métricas de Impacto",
        "full-exp-placeholder": "Bienvenido al **Modo Completo**. Aquí se detallan logros cuantificables y el impacto directo de mi trabajo, como: \"Desarrollo de un script en Python para la normalización de datos que redujo el tiempo de procesamiento en un 40%.\"",
        "mode-toggle-text": "Modo Resumen"
    }
}